{
  "users": [
    {
      "id": "555c",
      "username": "hkuzan",
      "email": "hasan@gmail.com",
      "password": "19To54..",
      "fullName": "Hasan Ihsan Kuzan",
      "avatar": "/images/users/hasan.jpg",
      "bio": "Merhaba, ben Hasan. 3. sınıfa gidiyorum."
    },
    {
      "id": "9ecb",
      "username": "bilal",
      "email": "bilal@example.com",
      "password": "12345.6",
      "fullName": "Bilal Deneme",
      "avatar": "/images/users/bilal.jpg",
      "bio": "Bilal burada yaşar"
    },
    {
      "id": "6482",
      "username": "omer",
      "email": "omer@example.com",
      "password": "12345.6",
      "fullName": "Omer Sahin",
      "avatar": "/images/users/omer.jpg",
      "bio": "Omer burada sen neredesin..."
    }
  ],
  "posts": [
    {
      "id": 1,
      "title": "Getting Started with My Dev Blog",
      "excerpt": "In this first post I explain why I started this blog and what you can expect here.",
      "content": "Welcome to my dev blog! Here I will share what I learn about React, Android, Firebase and small side projects I build in my free time. The idea is not to be perfect, but to document the journey. In the upcoming posts, I will show how I built a simple car rental app with React, how I use json-server as a fake API, and how I organize my learning as a parent and developer.",
      "category": "Development",
      "tags": [
        "react",
        "javascript",
        "learning"
      ],
      "userId": 1,
      "createdAt": "2025-11-20T10:00:00.000Z",
      "coverImage": "/images/posts/dev-blog-intro.jpg",
      "readingTime": 4
    },
    {
      "id": 2,
      "title": "Simple JSON Server Setup for React Projects",
      "excerpt": "A step-by-step mini guide on how to use json-server as a fake backend for your React apps.",
      "content": "In many tutorial projects, we don't want to set up a full backend. json-server is a great tool that lets you create a fake REST API from a simple db.json file. In this post, we create a db.json with users and posts, run json-server on port 3005 and connect it from React using axios. We also talk about common errors like 'command not found: json-server' and how to fix them using npx.",
      "category": "Development",
      "tags": [
        "json-server",
        "react",
        "api"
      ],
      "userId": 1,
      "createdAt": "2025-11-21T09:30:00.000Z",
      "coverImage": "/images/posts/json-server-setup.jpg",
      "readingTime": 5
    },
    {
      "id": 3,
      "title": "School, Projects and Finding Balance",
      "excerpt": "How we try to balance school projects, coding and family time without going crazy.",
      "content": "Between school projects, coding exercises and family life, it is easy to feel overwhelmed. In our family, we try to turn many tasks into small creative projects: building a podcast for biology, preparing German worksheets with ChatGPT, or creating a simple blog to practice coding. In this post I share a few routines that help us keep things fun and not too stressful.",
      "category": "Family",
      "tags": [
        "family",
        "school",
        "organization"
      ],
      "userId": 3,
      "createdAt": "2025-11-22T15:10:00.000Z",
      "coverImage": "/images/posts/family-balance.jpg",
      "readingTime": 6
    },
    {
      "id": 4,
      "title": "Study Tips for 7th Grade Students",
      "excerpt": "Some practical tips that helped us survive tests, presentations and projects in 7th grade.",
      "content": "Seventh grade can be intense: more homework, more tests, and more expectations. In this article, we collect simple strategies that worked for us: using colors for vocabulary, creating small escape-room style quizzes for history, preparing summary cards and using apps like Notion or simple paper planners. The idea is to make learning interactive, not boring.",
      "category": "School",
      "tags": [
        "study",
        "7th-grade",
        "tips"
      ],
      "userId": 2,
      "createdAt": "2025-11-23T11:45:00.000Z",
      "coverImage": "/images/posts/study-tips-7th.jpg",
      "readingTime": 5
    },
    {
      "id": 5,
      "title": "Weekend Walks Around Königstein",
      "excerpt": "Our favourite simple walks around Königstein and Frankfurt area to clear the head.",
      "content": "When coding or school gets too much, a short walk can reset your brain. Around Königstein and the Taunus area there are many easy routes: short forest paths, views over Frankfurt, and kid-friendly tracks. In this post, we share a few routes we like to walk on weekends, plus some tips on what to bring and how to keep it fun for the kids.",
      "category": "Lifestyle",
      "tags": [
        "travel",
        "germany",
        "family"
      ],
      "userId": 3,
      "createdAt": "2025-11-24T14:20:00.000Z",
      "coverImage": "/images/posts/konigstein-walks.jpg",
      "readingTime": 4
    },
    {
      "id": "695f",
      "title": "Rusya’dan WhatsApp’a yasaklama",
      "excerpt": "Rusya, yasaları ihlal ettiği gerekçesiyle WhatsApp'ı kademeli olarak engellenmeye başladı. Gerekçe olarak ise \"Terör eylemleri düzenlemek için kullanılıyor\" iddiası sunuldu.",
      "content": "Rusya’da yasaları ihlal ettiği gerekçesiyle WhatsApp kademeli olarak engellenmeye başladı.\n\nGelişmeyi ülkedeki Federal Bilgi Teknolojileri ve Kitle İletişim Denetleme Kurumu, Rus haber ajansı TASS’a açıkladı.\n\nÜlkede bugün WhatsApp’a erişimde sorun çıktığı bildirilmişti. Kurum, WhatsApp’ın Rus yasalarını ihlal etmeye devam ettiğini öne sürdü.\n\nAçıklamada “Bu mesajlaşma uygulaması, ülkede terör eylemleri düzenlemek, failleri işe almak, vatandaşlarımıza karşı dolandırıcılık ve diğer suçları işlemek için kullanılıyor” dendi. Rusya’nın ‘suçları önlemek için’ attığı adımlara WhatsApp’ın uymadığı belirtildi.\n\nAçıklamanın devamında WhatsApp’a karşı kısıtlayıcı önlemler alındığı ve kullanıcıların diğer mesajlaşma uygulamalarına geçmesine olanak tanımak için kısıtlamanın aşamalı yapıldığı söylendi.",
      "category": "World",
      "tags": [
        "rusya",
        "whatsapp",
        "yasak"
      ]
    }
  ]
}